In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['Coreyschafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [4]:
ex = pd.DataFrame(people)
ex

   first     last                   email
0  Corey  Schafer  Coreyschafer@gmail.com
1   Jane      Doe       JaneDoe@email.com
2   John      Doe       JohnDoe@email.com

#

#  Adding Column

In [6]:
ex['first'] + ' ' + ex['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [7]:
ex['full_name'] = ex['first'] + ' ' + ex['last']
ex

   first     last                   email      full_name
0  Corey  Schafer  Coreyschafer@gmail.com  Corey Schafer
1   Jane      Doe       JaneDoe@email.com       Jane Doe
2   John      Doe       JohnDoe@email.com       John Doe

#

# Removing Column

In [11]:
ex.drop(columns=['first', 'last'], inplace=True)

                    email      full_name
0  Coreyschafer@gmail.com  Corey Schafer
1       JaneDoe@email.com       Jane Doe
2       JohnDoe@email.com       John Doe

#### Splitting full name column

In [13]:
ex['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [14]:
ex[['first', 'last']] = ex['full_name'].str.split(' ', expand=True)

In [15]:
ex

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe

#

# Adding Rows

##### Adding single row of data

In [16]:
ex.append({'first': 'Tony'}, ignore_index=True)

C:\Users\Himz\AppData\Local\Temp\ipykernel_1048\779178976.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ex.append({'first': 'Tony'}, ignore_index=True)

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3                     NaN            NaN   Tony      NaN

####

In [18]:
people = {
    'first': ['Tony', 'Stark'],
    'last': ['Steve', 'Rogers'],
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

df2 = pd.DataFrame(people)

df2

   first    last               email
0   Tony   Steve  IronMan@avenge.com
1  Stark  Rogers      Cap@avenge.com

### Mixing up two dataframes

In [19]:
ex.append(df2, ignore_index=True)

C:\Users\Himz\AppData\Local\Temp\ipykernel_1048\898331330.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ex.append(df2, ignore_index=True)

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      IronMan@avenge.com            NaN   Tony    Steve
4          Cap@avenge.com            NaN  Stark   Rogers

In [20]:
ex = ex.append(df2, ignore_index=True)

C:\Users\Himz\AppData\Local\Temp\ipykernel_1048\1902910300.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ex = ex.append(df2, ignore_index=True)

In [21]:
ex

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      IronMan@avenge.com            NaN   Tony    Steve
4          Cap@avenge.com            NaN  Stark   Rogers

####

# Removing Rows

In [22]:
ex.drop(index=4)

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@email.com       Jane Doe   Jane      Doe
2       JohnDoe@email.com       John Doe   John      Doe
3      IronMan@avenge.com            NaN   Tony    Steve

In [29]:
filt = ex['last'] == 'Doe'

ex.drop(index = ex[filt].index)

                    email      full_name  first     last
0  Coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
3      IronMan@avenge.com            NaN   Tony    Steve
4          Cap@avenge.com            NaN  Stark   Rogers